#리스트 = 여러개의 연속된 값을 저장할 수 있는 저장공간

#점심메뉴 3개의 문자를 menu라는 변수에 담기

menu = ['부산밀면', '김치 오므라이스', '돼지 짜글이']

print(menu)
print(menu[0])

#딕셔너리가 뭐노
#튜플은 소괄호 딕셔너리는 중괄호 세트도 중괄호로 저장  세트는 키 값이 없음.
#else if > elif

#while 문을 사용할떈 종료할수잇는 종료조건을 설정해야한다.
#for문 > 여러개의 값을 저장하는 변수에서 반복하여 값을 꺼내어 사용
# dusts = [50,24,102]
# for value in dusts:
#     printv(value)  >> 결과 값 > 59 24 102
#for 반복문은 정해진 범위를 반복하기에 종료조건이 필요 없음.  > in 뒤에 들어오는 반복가능한 객체가 가지고 있는 모든 값에 대하여 순회함.
# 반복가능한 객체 종류 : list, dictionary = {k:v, k:v}, set, range() = 범위를 담고있음, str

